<!-- MAIN SECTION -->
<section class="section-main">
    <h3>Концепции программирования</h3>
    <p>
        <span class="colortext">Инкапсуляция:</span>&nbsp;Инкапсуляция представляет собой механизм программирования, 
        объединяющий код и данные, которыми он манипулирует.
    </p>
    <div class="line"></div>
    <p>
        <span class="colortext">Полиморфизм:</span>&nbsp;Полиморфизм (от греческого слова, означающего "много форм") 
        - это свойство, позволяющее с помощью одного интерфейса обращаться к общему классу действий.
    </p>
    <div class="line"></div>
    <p>
        <span class="colortext">Наследование:</span>&nbsp; &laquo;Наследование - 
        это процесс, в ходе которого один объект приобретает свойства другого объекта.&raquo;
    </p>
    <div class="line"></div>
</section>